export const navigation = [
  {
    name: '主页',
    navAddress: 'home',
    paths: [
      'M6.7,4.8h10.7c0.3,0,0.6,0.2,0.7,0.5l2.8,7.3c0,0.1,0,0.2,0,0.3v5.6c0,0.4-0.4,0.8-0.8,0.8H3.8C3.4,19.3,3,19,3,18.5v-5.6c0-0.1,0-0.2,0.1-0.3L6,5.3C6.1,5,6.4,4.8,6.7,4.8z',
      'M3.4,12.9H8l1.6,2.8h4.9l1.5-2.8h4.6',
    ],
  },
  {
    name: '安排',
    navAddress: 'edit',
    paths: [
      'M5.1,3.9h13.9c0.6,0,1.2,0.5,1.2,1.2v13.9c0,0.6-0.5,1.2-1.2,1.2H5.1c-0.6,0-1.2-0.5-1.2-1.2V5.1C3.9,4.4,4.4,3.9,5.1,3.9z',
      'M4.2,9.3h15.6',
      'M9.1,9.5v10.3',
    ],
  },
  {
    name: '日程',
    navAddress: 'browse',
    paths: [
      'M3.4,11.9l8.8,4.4l8.4-4.4',
      'M3.4,16.2l8.8,4.5l8.4-4.5',
      'M3.7,7.8l8.6-4.5l8,4.5l-8,4.3L3.7,7.8z',
    ],
  },
  {
    name: '抽奖',
    navAddress: 'wish',
    paths: [
      'M12 2.35l2.76 5.61 6.2.9-4.48 4.37 1.06 6.18L12 16.99l-5.54 2.91 1.06-6.18-4.48-4.37 6.2-.9z',
    ],
  },
];

export const editMenu = [
  {
    name: '待办',
    navAddress: 'todo',
  },
  {
    name: '备忘录',
    navAddress: 'memo',
  },
  {
    name: '日常',
    navAddress: 'routine',
  },
  {
    name: '假期',
    navAddress: 'holiday',
  },
];
